app/controllers/students_controller.rb

  def update
    set_student
    @student.update(post_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-07-07 16:16:46.922392"], ["id", 1]]

  def set_student
    @student = Student.find params[:id]
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]